In [1]:
from splinter import Browser
from bs4 import BeautifulSoup as soup
from webdriver_manager.chrome import ChromeDriverManager

In [2]:
# Set up Splinter
executable_path = {'executable_path': ChromeDriverManager().install()}
browser = Browser('chrome', **executable_path, headless=False)

[WDM] - Downloading: 100%|█████████████████| 8.41M/8.41M [00:00<00:00, 10.8MB/s]

In [4]:
# Visit the Mars Temperature Data site
url = 'https://data-class-mars-challenge.s3.amazonaws.com/Mars/index.html'
browser.visit(url)
# Optional delay for loading the page
#browser.is_element_present_by_css('div.list_text', wait_time=1)

In [5]:
html = browser.html
temp_soup = soup(html, 'html.parser')

In [7]:
table = temp_soup.find('table', class_='table')

In [59]:
data = []
mars_temps = {}
headers_list = []
rows = table.find_all('tr')
for row in rows:
    
    
    try:
        row_data = row.find_all('td')
        mars_temps[headers_list[0]] = row_data[0].text
        mars_temps[headers_list[1]] = row_data[1].text
        mars_temps[headers_list[2]] = row_data[2].text
        mars_temps[headers_list[3]] = row_data[3].text
        mars_temps[headers_list[4]] = row_data[4].text
        mars_temps[headers_list[5]] = row_data[5].text
        mars_temps[headers_list[6]] = row_data[6].text
        
        data.append(mars_temps)
        mars_temps = {}      
    
    except:
    
        row_heading = row.find_all('th')
        for i in row_heading:

            headers_list.append(i.text)

In [60]:
import pandas as pd

df = pd.DataFrame(data)
df

        id terrestrial_date   sol   ls month min_temp pressure
0        2       2012-08-16    10  155     6    -75.0    739.0
1       13       2012-08-17    11  156     6    -76.0    740.0
2       24       2012-08-18    12  156     6    -76.0    741.0
3       35       2012-08-19    13  157     6    -74.0    732.0
4       46       2012-08-20    14  157     6    -74.0    740.0
...    ...              ...   ...  ...   ...      ...      ...
1862  1889       2018-02-23  1973  133     5    -78.0    730.0
1863  1892       2018-02-24  1974  134     5    -77.0    729.0
1864  1894       2018-02-25  1975  134     5    -76.0    729.0
1865  1893       2018-02-26  1976  135     5    -77.0    728.0
1866  1895       2018-02-27  1977  135     5    -77.0    727.0

[1867 rows x 7 columns]

In [93]:
results = df.dtypes
results

id                           int64
terrestrial_date    datetime64[ns]
sol                          int64
ls                           int64
month                        int64
min_temp                   float64
pressure                   float64
dtype: object

In [108]:
convert_dict = {'id':int,'sol':int,'ls':int,'month':int,'min_temp':float,'pressure':float}

df = df.astype(convert_dict)

In [109]:
from datetime import datetime

df['terrestrial_date'] = df['terrestrial_date'].apply(pd.to_datetime)
print(df.dtypes)

id                           int64
terrestrial_date    datetime64[ns]
sol                          int64
ls                           int64
month                        int64
min_temp                   float64
pressure                   float64
dtype: object

In [110]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1867 entries, 0 to 1866
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id                1867 non-null   int64
 1   terrestrial_date  1867 non-null   datetime64[ns]
 2   sol               1867 non-null   int64
 3   ls                1867 non-null   int64
 4   month             1867 non-null   int64
 5   min_temp          1867 non-null   float64
 6   pressure          1867 non-null   float64
dtypes: datetime64[ns](1), float64(2), int64(4)
memory usage: 102.2 KB

In [111]:
df.describe()

,id,sol,ls,month,min_temp,pressure
count,1867.000000,1867.000000,1867.000000,1867.000000,1867.000000,1867.000000
mean,955.551152,1015.670059,168.865024,6.141939,-76.121050,841.066417
std,545.048507,565.342298,105.599153,3.506493,5.504098,54.253226
min,2.000000,10.000000,0.000000,1.000000,-90.000000,727.000000
25%,489.500000,546.500000,78.000000,3.000000,-80.000000,800.000000
50%,959.000000,1028.000000,160.000000,6.000000,-76.000000,853.000000
75%,1425.500000,1505.500000,257.500000,9.000000,-72.000000,883.000000
max,1895.000000,1977.000000,359.000000,12.000000,-62.000000,925.000000

In [113]:
#How many months exist on Mars? 
12

12

In [116]:
# Which month, on average, has the lowest temperature? The highest?
#lowest temp = -90
#highest temp = -62

In [115]:
# Which month, on average, has the lowest atmospheric pressure? The highest?
#lowest pressure = 727
#highest pressure = 925

In [ ]:
# How many terrestrial days exist in a Martian year?